Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.GetModeOverride(Autodesk.Revit.DB.PointCloudColorMode)
Lookup color settings for the given color mode.
mode:
Color mode for which to lookup the color settings.
Returns:
Color settings stored for the given color mode or default color settings if nothing is stored for the given color mode.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.SetModeOverride(Autodesk.Revit.DB.PointCloudColorMode,Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Sets color settings for the given color mode.
mode:
Color mode for which color settings are set.
colorSettings:
Color settings to be set for the given color mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Checks if the contents of two settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Assign(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Assigns values of the source settings to this object.
other:
The source settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.ColorMode
The current color mode for the PointCloudInstance element or its scan.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Visible
Visibility flag for point cloud scans.
Remarks:
This flag is used only for visibility of point cloud scans
because the visibility of the whole point cloud element is managed as for other elements hidden in the view.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor
Constructs a settings object with default values.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
The graphic override settings for one PointCloudInstance element or one of its scans.
Since:
2014